Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::RoutingSegmentDefault Class Reference
MEP Element Manager
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment. More...
#include <MEPRoutingSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingSegmentDefault:
 Public Member Functions
 RigidSegmentDefault  | GetRigidSegmentDefault () const
Returns the RigidSegmentDefault of the RoutingSegmentDefault.
 double  | GetCrossSectionWidth () const
Returns the width of Cross Section in the Routing Segment.
 double  | GetCrossSectionHeight () const
Returns the height of Cross Section in the Routing Segment.
 ConnectorShape  | GetCrossSectionShape () const
Returns the shape of Cross Section in the Routing Segment.
 Domain  | GetDomain () const
Returns the domain of the default.
UniqueID  | GetPreferenceTableId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | SetRigidSegmentDefault (const RigidSegmentDefault &rigidSegmentDefault) const
Sets the RigidSegment to the RoutingSegmentDefault.
void  | SetCrossSectionWidth (double width)
Sets the width of Cross Section in the RoutingSegmentDefault.
void  | SetCrossSectionHeight (double height)
Sets the width of Cross Section in the RoutingSegmentDefault.
void  | SetCrossSectionShape (ConnectorShape shape)
Sets the shape of Cross Section in the RoutingSegmentDefault.
Result< void >  | SetPreferenceTableId (const UniqueID &uniqueId)
Sets the PreferenceTable of the RoutingSegmentDefault.
 Protected Member Functions
RoutingSegmentDefault (std::shared_ptr< Impl::IRoutingSegmentDefaultImpl >)
 Static Protected Member Functions
 static Result< RoutingSegmentDefault >  | Create (const API_Token &, Domain)
 Friends
 class  | RoutingElement
 class  | RoutingElementDefault
 class  | RoutingSegment
Result< RoutingSegmentDefault >  | CreateRoutingSegmentDefault (Domain)
Creates a RoutingSegmentDefault.
Detailed Description
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault RoutingSegmentDefault Modification
 // PickUp RoutingElementDefault from RoutingElement
 RoutingElementDefault routingElementDefault = routingElement.PickUpDefault ();
 // Get RoutingSegmentDefault of RoutingElementDefault and modify it
 RoutingSegmentDefault routingSegmentDefault = routingElementDefault.GetRoutingSegmentDefault ();
 double currentWidth = routingSegmentDefault.GetCrossSectionWidth ();
 double currentHeight = routingSegmentDefault.GetCrossSectionHeight ();
 ACAPI::Result<void> segmentDefaultModifyResult = routingSegmentDefault.Modify ([&](RoutingSegmentDefault::Modifier& modifier) {
 modifier.SetCrossSectionWidth (2.0 * currentWidth);
 modifier.SetCrossSectionHeight (2.0 * currentHeight);
 });
 if (segmentDefaultModifyResult.IsErr ())
 return segmentDefaultModifyResult.UnwrapErr ().kind;
 // Set RoutingSegmentDefault back to RoutingElementDefault
 ACAPI::Result<void> elementDefaultModifyResult = routingElementDefault.Modify ([&](RoutingElementDefault::Modifier& modifier) {
 modifier.SetRoutingSegmentDefault (routingSegmentDefault);
 });
 if (elementDefaultModifyResult.IsErr ())
 return elementDefaultModifyResult.UnwrapErr ().kind;
 // Inject RoutingElementDefault into RoutingElement
 ACAPI::Result<void> injectResult = routingElement.Modify ([&routingElementDefault](RoutingElement::Modifier& modifier) {
 modifier.Inject (routingElementDefault);
 }, "Inject Default into RoutingElement.");
 if (injectResult.IsErr ())
 return injectResult.UnwrapErr ().kind;
 return NoError;
Member Function Documentation
◆ GetPreferenceTableId()
 UniqueID ACAPI::MEP::v1::RoutingSegmentDefault::GetPreferenceTableId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable is associated with.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetCrossSectionHeight()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionHeight  |  ( |  double  |  height | )
Sets the width of Cross Section in the RoutingSegmentDefault.
Parameters
height | The value to be set.
◆ SetCrossSectionShape()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionShape  |  ( |  ConnectorShape  |  shape | )
Sets the shape of Cross Section in the RoutingSegmentDefault.
Parameters
shape | The value to be set.
◆ SetCrossSectionWidth()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionWidth  |  ( |  double  |  width | )
Sets the width of Cross Section in the RoutingSegmentDefault.
Parameters
width | The value to be set.
◆ SetPreferenceTableId()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetPreferenceTableId  |  ( |  const UniqueID &  |  uniqueId | )
Sets the PreferenceTable of the RoutingSegmentDefault.
Parameters
uniqueId | The UniqueID of the PreferenceTable.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ SetRigidSegmentDefault()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetRigidSegmentDefault  |  ( |  const RigidSegmentDefault &  |  rigidSegmentDefault | ) |   const
Sets the RigidSegment to the RoutingSegmentDefault.
Parameters
rigidSegmentDefault | The value to be set.
Friends And Related Symbol Documentation
◆ CreateRoutingSegmentDefault
 Result< RoutingSegmentDefault > CreateRoutingSegmentDefault  |  ( |  Domain  |  domain | )
friend
Creates a RoutingSegmentDefault.
Parameters
domain | The Domain of the requested RoutingSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingSegment from the Routing tool for the domain defined by the parameter, otherwise Error.